{
    "soil": "Fertile well-drained alluvial or simply red loams free of coarse elements and full off nitrogen are ideal soils for maize cultivation. Maize can be grown on wide range of soils including loamy sand to clay loam. Soils with fine organic matter containing good water holding capacity with pH ranging from 5.5-7.5 are required to increase yield. Heavy clay soil is not suitable for cultivation.",
    "TimeOS": "In kharif season, crop is sown in month of May end to June corresponding with the onset of monsoon. Spring crops are sown during late February to end of march. Plantation of baby corn can be done all the year round, except December and January. Kharif and rabi season are best for sweet corn sowing.",
    "Spacing": "To obtain higher yield along with resource-use efficiency, optimum plant spacing is the key factor. For kharif maize use spacing of 60x20 cm.",
    "SDepth": "Seed should be sown at depth of 3-4 cm. For sweet corn cultivation keep depth of sowing to 2.5 cm.",
    "SeedR": "Purpose, seed size, season, plant type, sowing method these factor affect seed rate. For kharif maize use seed rate of 8-10 kg/acre.",
    "Irrigation": "Apply irrigation immediately after sowing. Based upon soil type, on third or fourth day give lifesaving irrigation. In rainy season, if rain is satisfactory then it is not needed. Avoid water stagnation in early phase of crop and provide good drainage facility. Crop required less irrigation during early stage, 20 to 30 days after sowing afterwards it required irrigation once in a week. Seedling, knee height stage, flowering and grain feeling are the most sensitive stage for irrigation. Water stress at this stage cause huge loss in yield.",
    "Harvesting": "Harvesting should be done when cobs outer cover turns from green to white. The optimum time of harvesting maize is when the stalks have dried and moisture of grain as about 17-20%. Drying place or equipment should be dry, clean and disinfected.",
    "PHarvest": "Sweet corn must be moved quickly from the field to packing sheds, where it should be rapidly sorted, packed, and cooled. It is generally packed in wire bound wooden crates, which can hold from 4 to 6 dozen ears, depending on the size of the crate or ears."
}